{
  "posts": [
    {
      "id": "57c4",
      "title": "When You’re Disconnecting from God",
      "description": "Written by Ashley Henson Ashley Henson is the Student Pastor at our Newbreak Scripps Ranch Campus.  Ashley and her husband Josh are originally from Oklahoma but have found themselves more at home than ever in the beautiful city of San Diego! You’ll find them on the weekends with their dog-child, Scout, exploring beaches or hiking local trails. Ashley has a heart for and a great belief in our next generation. Her passion is that every student has a welcome space to figure out their faith, not just adopt someone else’s, and then live that faith out. She loves taking students to coffee, getting to know their hearts and helping them to know just how much of an impact they can make in this world!",
      "content": "I’ve never made the intentional decision to walk away from God, but I have found myself disconnected from Him.\nThere have been seasons where as soon as I start my day, I begin thinking about what I emails I need to respond to, and the people I need to call back, and the projects I need to finish, and the friends I need to catch up with, and the spouse that I need to show some attention to, and the lunches that need to be packed, and the bills that need to be paid, and somewhere in there I need to take care of my own mental health, physical health, emotional health but I also need to make sure dinner is ready, and that my dog gets walked, is the laundry done, is project complete, did I send those final emails…and the cycle goes on and on.\n\nAnd now at this point I feel overwhelmed, burdened and begin questioning “God, where are you in all of this?!”\n\nI wonder if God looks at us and says, “No, where are YOU? I’ve been here this whole time, waiting for you.”\n\nBecause not ONCE did I even think about, let alone rely on God. I got so busy with life and doing things all on my own and I found myself disconnected from Jesus.\n\nJesus actually talks specifically to when we find ourselves DISCONNECTED from God. Not on purpose, but because life has found us in a season where we’ve drifted. When He gives His final “I AM” statement in John 15, it’s one that deals directly with our relationship with Him…and here’s what I learned in studying it.\n\nI can do nothing without Jesus. (John 15: 5)\nWe hear and believe all the time: “Add this to your life, it will make it better…Here’s this new supplement, accessory, workout, etc.” We fall into diet fads, try new hobbies, buy new clothes, add supplements to our life all hoping that what has been promised happens, our life will become better.\n\nSometimes we view Jesus like this; “Add Jesus to your life, He will make it better.”\n\nWhen Jesus gives us the analogy of Him as the Vine and us as the branches, what He’s saying is that He is not interested in being like a supplement to your life. He uses this picture of the vine and the branch because it depicts absolute complete dependence on Him. He doesn’t want to be something you “add” to your life.\n\nJesus wants to be the SOURCE of your life.\nIf being connected to Jesus is vital for a branch to grow and survive, do you know what else is important? Pruning. Pruning is just as important to growth as planting the seed and watering it.\n\nPruning is the idea of removing and exposing things in our life. More often than not, a season of pruning brings some type of loss…a loss of finances, possessions, impact, influence, position, stature, relationship, or opportunity. To be pruned is to lose the basis upon which you and everyone around you measure success. Pruning removes anything that we rely on instead of God (because remember, we can do NOTHING without Him).\n\nhttps://newbreak.church/wp-content/uploads/bb-plugin/cache/kipzmgg_udg-portrait-c27dd036cd23ca5920ab02a36c131b7e-kbny0dcts5jh.jpg\n\nGod’s pruning is for my benefit. (John 15: 2)\nLeft to itself, a vine will produce a lot of dead wood and unproductive growth. Cutting away the dead and the growth helps to produce what’s good. In fact, pruning allows the fruit to grow back healthier and more fruitful.\n\nLet’s be honest, none of us are praying for a pruning season…we hate it because it’s not fun or comfortable. We’re praying for FRUIT to show up in our lives (more peace, love, etc). But the truth is everybody is praying for a harvest that only pruning can produce.\n\nCan I challenge you? Everything God is leading you to do is for your good–even if it is hard to see in the moment.\n\nIf the Lord is asking you to lay something down, don’t fight it, trust Him\nIf the Lord is asking you to do something sacrificial, trust Him.\nPruning is for YOUR benefit, YOUR good.\nHere’s the cool thing, when we remain connected to Jesus we don’t just begin to see fruit (love, joy, peace, etc) in our lives…",
      "author": "Vishal Sharma",
      "photo": "https://lh3.googleusercontent.com/a/ACg8ocIdU-cvOV-LBbHVaUhDCWSL1J47WUe-KEOF8RjlxKmq8Iv_Gg=s96-c",
      "media": "",
      "": "C:\\fakepath\\download.jpeg"
    }
  ]
}