{
  "posts": [
    {
      "id": "6289",
      "title": "Focused on Nutrition, No Matter the Circumstances",
      "description": "Making Nutrition a Priority During COVID-19 Almost immediately, the food donations that MFB relied on from retail partners declined dramatically, forcing MFB to purchase high volumes of food versus the previous practice of distributing mostly donated products. Providing healthy foods, especially during a pandemic, came at a cost, but with agility, the food bank persevered, and kept food flowing into critical areas of need.",
      "content": "Making Nutrition a Priority During COVID-19\nAlmost immediately, the food donations that MFB relied on from retail partners declined dramatically, forcing MFB to purchase high volumes of food versus the previous practice of distributing mostly donated products. Providing healthy foods, especially during a pandemic, came at a cost, but with agility, the food bank persevered, and kept food flowing into critical areas of need.\n\n“The pandemic pushed us farther than we ever imagined in terms of our ability to get nutritious foods into the hands of our neighbors in need,” said Booyer. “The volume of donated food went down significantly, but our commitment to the people of Maryland required an expensive pivot to purchasing more nutritious food than we ever have before.”\n\nThis shift in food sourcing ultimately proved to be advantageous, providing MFB more flexibility and control over the types of food available to its network of community partners. Even so, distribution remained a challenge.\n\nBreaking Down Barriers with BUBs\nDue to the travel restrictions, supply chain disruptions, safety measures, and other issues, distributing any type of food proved difficult. That’s when we made a traditional food bank idea new again – packing 30 pounds of shelf stable foods into Back up Boxes, which we lovingly dubbed “BUBs.”\n\n“In those early weeks, we didn’t have access to most of the foods that we had been able to rely on to distribute, but we still made sure that the BUBS had a variety of foods for families to cook and eat together,” said Kate Long, MFB’s Director of Nutrition Programs\n\nAlthough BUBs worked extremely well, we recognized early on that they could be improved.\n\nBUBs 2.0 items\n\n“We never wanted to just ‘put food out into the community,’ so when food availability eased up, we made sure that “BUBs 2.0” met our standards for healthy food, meaning all items had to be low in sugar, salt, saturated fat, and contain whole grains,” said Long.\n\nThe challenges of limited food availability affected other areas of the food bank as well, including our MFB Kids program.\n\nKeeping Kids Fed During COVID\nOur professional chefs, employees responsible for creating healthy and kid-friendly meals for one of our most vulnerable populations, were forced to innovate.\n\nWe know poor nutrition can lead to poor health and lessened academic and social performance, but we also know that ensuring access to food at schools and out-of-school programs helps to counteract these barriers to success.\n\ntwo kids at a food distribution\nSo when children were forced to switch to remote learning and lost access to that food, our culinary team stepped up, and in a few short weeks, transformed our traditional MFB Kids production process into a pandemic-friendly Grab & Go meal program.\n\nMFB’s Executive Chef Alex Thacker led that charge, guided by the philosophy that “you shouldn’t serve the food unless you would serve it to your own family.”\n\nChef Alex and his team worked through supply chain issues to develop a menu so varied that children and their families relying on the Grab & Go program could go an entire month without eating the same meal twice. The team continually improved the nutritional value of the meals, without losing sight of the need to keep them kid friendly.\n\n“I’m really proud of the fact that despite all of the challenges, we were able to make changes — like replacing fruit cups and applesauce with fresh-cut pineapple and grapes — which are not only healthier options, but foods kids actually want to eat.”\n\nChef Alex Thacker\nExecutive Chef, Maryland Food Bank\n\nFocusing on Nutrition for Maryland’s Future\n\nSo, what does this consistent focus on nutrition really mean for Marylanders in need?\n\nWhen our neighbors suffer from poor nutrition, we all suffer. But by working together to ensure all Marylanders have the ability to make better choices – through the equitable distribution of high nutritional quality food, through education, and through constantly monitoring and reassessing our programs – we can do better for our neighbors in need, lifting up the entire state.\n\nIn our next blog post, we’ll explore some of the innovative ways that the Maryland Food Bank is dovetailing previous efforts with the lessons learned during the pandemic to make sure that all Marylanders – regardless of geography or demography – have consistent and equal access to nutritious foods.\n\n",
      "author": "Guest",
      "photo": "https://images.macrumors.com/t/n4CqVR2eujJL-GkUPhv1oao_PmI=/1600x/article-new/2019/04/guest-user-250x250.jpg",
      "media": {}
    }
  ]
}